# Написать программу "Показать звезды". На вход принимает обычное целое число,
# должно напечатать количество звезд:
# Пример:
# Input number of stars: 8
# ********

print("Hi, dude!")
asterix = int(input("Pls enter any number here: "))
print(asterix * "*")